/*

MIT License

Copyright (c) 2024 JustStudio. <https://juststudio.is-a.dev/>

Permission is hereby granted, free of charge, to any person obtaining a copy
of this software and associated documentation files (the "Software"), to deal
in the Software without restriction, including without limitation the rights
to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
copies of the Software, and to permit persons to whom the Software is
furnished to do so, subject to the following conditions:

The above copyright notice and this permission notice shall be included in all
copies or substantial portions of the Software.

THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
SOFTWARE.

*/

const Translations = {
    "RU": {
        "1": "JustStudio.",
        "2": "a System Development Studio",
        "3": "Условия",
        "4": "Пользовательское Соглашение",
        "5": "Правила Для Игроков",
        "6": "Сервисы",
        "7": "JustStudio.Аккаунт",
        "8": "API",
        "9": "Игры",
        "10": "Скоро будут...",
        "11": "RU",
        "12": "© 2024 JustStudio.",
        "13": "Правила для Игроков",
        "14": "Правила для игроков, играющих в игры от \"JustStudio.\", на платформе Roblox.",
        "15": "Основное",
        "16": "Соблюдайте <a target=\"_blank\" href=\"https://en.help.roblox.com/hc/en-us/articles/115004647846-Roblox-Terms-of-Use\" rel=\"noreferrer noopener nofollow\" style=\"text-decoration: underline;\">Условия Использования платформы Roblox</a>. Если кратко, несколько простых правил: Не ругаться. Относиться ко всем положительно. Никаких свиданий, или другого контента для взрослых. Никакой дискриминации. Никакой пропоганды чего бы то ни было. Также запрещается упоминать/воссоздавать экстремистские действия. Не использовать во время игры стороннее програмное обеспечение для изменения программного кода игры. Играйте в игры честно, и наслаждайтесь игрой. Примечание: Приведенные выше правила не являются официальными правилами платформы Roblox. Они также могут быть некорректными или устаревшими. Пожалуйста, ознакомьтесь с <a target=\"_blank\" href=\"https://en.help.roblox.com/hc/en-us/articles/115004647846-Roblox-Terms-of-Use\" rel=\"noreferrer noopener nofollow\" style=\"text-decoration: underline;\">Roblox Terms of Use</a>.",
        "17": "Правила JustStudio.",
        "18": "Играя в наши игры, опубликованные на платформе Roblox, вы соглашаетесь с этими правилами, а также Пользовательским Соглашением. Если нарушитель не знает данных правил или не знает Пользовательское Соглашение, или не согласен с данными правилами или не согласен с Пользовательским Соглашением, это не освобождает его от наказания (временной или бессрочной блокировки учётной записи). Мы не являемся партнерами/частью/подразделением/и т.д. Roblox Corporation. Все игроки обязаны относиться к администрации и модерации положительно. Если, как Вам кажется, какое-либо действие администратора или модератора, относящееся к Вам/игроку/игрокам, было сделано по ошибке, Вы можете сообщить об этом (или подать апелляцию) в нашу поддержку, расположенную на нашем <a href=\"https://discord.gg/aHXxS6VvcC\" target=\"_blank\"><span style=\"text-decoration: underline;\">сервере Discord</span></a>. Относитесь к \"JustStudio.\", Администрации, Модерации, Разработчикам, и нашим Партнёрам, а также к другим игрокам положительно. Любой вид отрицательного отношения, травли, и т. п. строго запрещены!",
        "19": "О Блокировке Учётной Записи",
        "20": "О блокировках учётных записей на играх и любых других ресурсах, созданные \"JustStudio.\", на платформе Roblox. Мы оставляем за собой право запрещать пользователям (игрокам) играть в свои игры и/или использовать наши ресурсы (блокировать учётные записи).",
        "21": "Причины",
        "22": "Мы можем заблокировать Вашу учётную запись если Вы нарушаете данные правила, либо нарушаете Пользовательское Соглашение. Также Ваша учётная запись может быть заблокировка по следующим причинам: Если вы являетесь другом/союзником/партнёром/и т. д. пользователя (игрока), который был заблокирован; Если Вы совершили (или являетесь участником) аттаку (\"рейд\") любого вида, на \"JustStudio.\"; Если Вы пытаетесь найти лозейки в данных правилах, Пользовательском Соглашении, или в любых других условиях или положениях.",
        "23": "Подробности",
        "24": "Если Ваша учётная запись была заблокированна в любой игре, созданной \"JustStudio.\", то Вы (Ваши учётные записи) также будете заблокированны временно или бессрочно (в зависимости от причины блокировки учётной записи) в других играх, сервисах, и любых других ресурсах, созданных \"JustStudio.\"; Также если Вы (Ваши учётные записи) были заблокированны в любом сервисе/ресурсе, созданном \"JustStudio.\", то Ваша учётная запись будет бессрочно заблокирована абсолютно на всех играх/сервисах/любых других ресурсах, которые созданны \"JustStudio.\"",
        "25": "Апелляции",
        "26": "Если Вы считаете, что Ваша учётная запись (или Ваши учётные записи) были заблокированны по ошибке, то Вы можете подать апелляцию в поддержку, расположенную на нашем <a href=\"https://discord.gg/aHXxS6VvcC\" target=\"_blank\"><span style=\"text-decoration: underline;\">Discord сервере</span></a>.",
        "27": "Информация",
        "28": "Обновлено: December 25th, 2024<br>Версия: 1.3.1<br>Перевод Правил Для Игроков может быть некорректным. Мы рекомендуем Вам ознакомиться с версией на английском языке.",
        "29": "Пользовательское Соглашение",
        "30": "Посещение и использование нашего веб-сайта, а также игр и любых других наших сервисов или ресурсов, проектов и т.д. означает, что вы согласны с пользовательским соглашением, а также со всеми правилами и другими положениями и условиями.",
        "31": "Условия Использования",
        "32": "Мы можем изменять эти правила и все другие условия, соглашения, положения без уведомления кого-либо. Ваше дальнейшее использование сайта, игр, продуктов, проектов и т.д., созданных \"JustStudio.\", после внесения изменений в любые условия означает ваше согласие с изменениями. \"JustStudio.\" - это студия, которая направлена на разработку игр на платформе Roblox, но также имеет проекты, не связанные с Roblox. Наши веб-сайты, проекты и продукты и т.д. Расположены только на этих доменных именах: juststudio.is-a.dev, just.is-a.dev, j.is-a.dev, <a href=\"#domains\" class=\"stfl\">посмотреть полный список</a> (игры, опубликованные на платформе Roblox никак не относятся к этому и иметь своих доменных имён не могут, только страницу на платформе Roblox, у которой есть свои доменные имена), все остальные доменные имена к нам никак не относятся, кроме некоторых доменных имён, принадлежащих членам нашей команды (<a href=\"#tdomains\" class=\"stfl\">посмотреть список</a>) и некоторых доменных имён, принадлежащих нашим партнёрам (reavercommunity.dcms.site, kappy.is-a.dev, <a href=\"#pdomains\" class=\"stfl\">посмотреть полный список</a>). Доменные имена партнёров и членов нашей команды и веб-сайты, относящиеся к этим доменным именам, поддерживаются нашими серверами и сервисами, но мы не имеем никакого отношения, и не отвечаем за, контент на вебсайтах и доменных именах партнёров и членов нашей команды. \"JustStudio.\" никоим образом не является аффилированным лицом Roblox Corporation, Microsoft Corporation, Google LLC, Discord Inc., Clerk Inc., Spline Inc. и GitHub Inc. Мы не авторизованы, не одобрены и не спонсируемся Roblox Corporation, Microsoft Corporation, Google LLC, Discord Inc., Clerk Inc., Spline Inc. и GitHub Inc. Все товарные знаки Roblox остаются собственностью Roblox Corporation. Все товарные знаки Microsoft остаются собственностью Microsoft Corporation. Все товарные знаки Discord остаются собственностью Discord Inc. Все товарные знаки GitHub остаются собственностью GitHub Inc. Все товарные знаки Google остаются собственностью Google LLC. Все товарные знаки Clerk остаются собственностью Clerk Inc. Все торговые марки Spline остаются собственностью Spline Inc.",
        "33": "Конфиденциальность и Безопасность",
        "34": "Мы оставляем за собой право собирать и хранить данные о вашей учетной записи на платформе Roblox каждый раз, когда вы посещаете наши игры или используете наши ресурсы на платформе Roblox. Мы собираем и храним следующие данные о вашей учетной записи на платформе Roblox: UserID, UserName, UserDisplayName, AccountAge, <a class=\"stfl\" href=\"#data\">посмотреть полный список</a>, а также ваши действия в наших играх. Все данные о Вашей учётной записи, которые мы собираем и храним, предоставляются платформой Roblox, без использования сторонних ресурсов. Вы можете запросить удаление всех собранных данных о Вашей учётной записи, написав запрос в поддержку на нашем <a href=\"https://discord.gg/aHXxS6VvcC\" target=\"_blank\"><span style=\"text-decoration: underline;\">сервере Discord</span></a>. Учтите, что если после удаления данных о Вашей учётной записи, Вы используете наши сервисы/ресурсы, или поигратете в наши игры на платформе Roblox, мы снова соберем и сохраним данные о Вашей учетной записи. Никакие третьи лица не получат доступ к сохранённым данным. Мы собираем и храним данные о вашей учетной записи только в целях улучшения наших игр, сервисов, и других ресурсов.",
        "35": "Платный Контент",
        "36": "Преобритая платный контент Вы соглашаетесь с Пользовательским Соглашением. Приобретение платного контента необязательно, покупка совершается по Вашему решению, мы не заставляем кого-либо покупать что-либо. После приобретения, платный контент в играх выдаётся автоматически, никаких сбоев быть не может. Платные роли на нашем <a href=\"https://discord.gg/aHXxS6VvcC\" target=\"_blank\"><span style=\"text-decoration: underline;\">Discord сервере</span></a> выдаются вручную, главной администрацией. Никакие средства возврату не подлежат.",
        "37": "Информация",
        "38": "Обновлено: December 26th, 2024<br>Version: 1.0.4<br>Перевод Пользовательского Соглашения может быть некорректным. Мы рекомендуем Вам ознакомиться с версией на английском языке.",
        "39": "след.",
        "40": "возв.",
        "41": "Доменные имена \"JustStudio.\"",
        "42": "Доменные имена членов нашей команды, к которым относится \"JustStudio.\"",
        "43": "Доменные имена наших партнёров, к которым относится \"JustStudio.\"",
        "44": "Данные, которые мы собираем"
    }
}
